Core/src/Documents/ВнутреннийЗаказ/ВнутреннийЗаказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннийЗаказ</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыНаПеремещение</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаОтправитель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВизита</name>
    <type>
      <types>DocumentRef.Визит</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказаНаПеремещения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденноеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/AccumulationRegisters/ЗаказыНаПеремещение/ЗаказыНаПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыНаПеремещение</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/ЗаказыПокупателей/ЗаказыПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПокупателей</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Запасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоррСтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррХарактеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррПартия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСпецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПродажи</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.СписаниеЗапасов</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПеремещениеЗапасов</types>
      <types>DocumentRef.ЧекККМВозврат</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПересортицаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВРозницуСуммовойУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Резервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/РазмещениеЗаказов/РазмещениеЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РазмещениеЗаказов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсточникОбеспечения</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Enums/СтатусыЗаказаНаПеремещения/СтатусыЗаказаНаПеремещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказаНаПеремещения</name>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийЗаказПокупателя/ВидыОперацийЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЗаказПокупателя</name>
  <enumValues>
    <name>ЗаказНаПродажу</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаПереработку</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаряд</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ВнутреннийЗаказ/ObjectModule.bsl
//Переменные
Перем ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах");
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры
	
	
//Процедура ОбработкаЗаполнения(ДокументСсылкаЗаказПокупателя)
//	
//	
//	Если Не ЗначениеЗаполнено(ДокументСсылкаЗаказПокупателя) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	// Заполнение шапки.
//	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылкаЗаказПокупателя,
//	Новый Структура("Организация, Ссылка, ВидОперации, Старт, ДатаОтгрузки, СостояниеЗаказа, Проведен, ОжидаетсяВыборВариантаКП"));
//	
//	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(ДокументСсылкаЗаказПокупателя, ЗначенияРеквизитов);
//	
//	Организация = ЗначенияРеквизитов.Организация;
//	ЗаказПокупателя = ЗначенияРеквизитов.Ссылка;
//	//Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
//	//	ДатаПоступления = ЗначенияРеквизитов.Старт;
//	//Иначе
//	//	ДатаПоступления = ЗначенияРеквизитов.ДатаОтгрузки;
//	//КонецЕсли;
//	
//	// Заполнение табличной части.
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
//	|	ЗаказыОстатки.Характеристика КАК Характеристика,
//	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
//	|		ЗаказыОстатки.Характеристика КАК Характеристика,
//	|		ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
//	|	ИЗ
//	|		РегистрНакопления.ЗаказыПокупателей.Остатки(
//	|				,
//	|				ЗаказПокупателя = &ДокументОснование
//	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗаказыОстатки
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ЗапасыОстатки.Номенклатура,
//	|		ЗапасыОстатки.Характеристика,
//	|		-ЗапасыОстатки.КоличествоОстаток
//	|	ИЗ
//	|		РегистрНакопления.Запасы.Остатки(
//	|				,
//	|				ЗаказПокупателя = &ДокументОснование
//	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗапасыОстатки
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		РазмещениеОстатки.Номенклатура,
//	|		РазмещениеОстатки.Характеристика,
//	|		-РазмещениеОстатки.КоличествоОстаток
//	|	ИЗ
//	|		РегистрНакопления.РазмещениеЗаказов.Остатки(
//	|				,
//	|				ЗаказПокупателя = &ДокументОснование
//	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК РазмещениеОстатки
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ДвиженияДокументаРазмещениеЗаказов.Номенклатура,
//	|		ДвиженияДокументаРазмещениеЗаказов.Характеристика,
//	|		ВЫБОР
//	|			КОГДА ДвиженияДокументаРазмещениеЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
//	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
//	|		КОНЕЦ
//	|	ИЗ
//	|		РегистрНакопления.РазмещениеЗаказов КАК ДвиженияДокументаРазмещениеЗаказов
//	|	ГДЕ
//	|		ДвиженияДокументаРазмещениеЗаказов.Регистратор = &Ссылка
//	|		И ДвиженияДокументаРазмещениеЗаказов.ЗаказПокупателя = &ДокументОснование) КАК ЗаказыОстатки
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ЗаказыОстатки.Номенклатура,
//	|	ЗаказыОстатки.Характеристика
//	|
//	|ИМЕЮЩИЕ
//	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	МИНИМУМ(ЗаказПокупателяЗапасы.НомерСтроки) КАК НомерСтроки,
//	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
//	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
//	|	ВЫБОР
//	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
//	|			ТОГДА 1
//	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
//	|	КОНЕЦ КАК Коэффициент,
//	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	|	ВЫБОР
//	|		КОГДА ЗаказПокупателяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
//	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Старт
//	|		ИНАЧЕ ЗаказПокупателяЗапасы.ДатаОтгрузки
//	|	КОНЕЦ КАК ЗапасыДатаПоступления,
//	|	ЗаказПокупателяЗапасы.СтавкаНДС,
//	|	СУММА(ЗаказПокупателяЗапасы.Количество) КАК Количество,
//	|	ЗаказПокупателяЗапасы.Спецификация
//	|ИЗ
//	|	ВТЗаказПокупателяЗапасы КАК ЗаказПокупателяЗапасы
//	|ГДЕ
//	|	ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ЗаказПокупателяЗапасы.Номенклатура,
//	|	ЗаказПокупателяЗапасы.Характеристика,
//	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
//	|	ЗаказПокупателяЗапасы.СтавкаНДС,
//	|	ВЫБОР
//	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
//	|			ТОГДА 1
//	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ЗаказПокупателяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
//	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Старт
//	|		ИНАЧЕ ЗаказПокупателяЗапасы.ДатаОтгрузки
//	|	КОНЕЦ,
//	|	ЗаказПокупателяЗапасы.Спецификация
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	НомерСтроки";
//	
//	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(ДокументСсылкаЗаказПокупателя, Запрос.МенеджерВременныхТаблиц, Ложь);
//	
//	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
//		
//		Запрос.Текст = Запрос.Текст + "; " +
//		"ВЫБРАТЬ
//		|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
//		|	ЗаказыОстатки.Характеристика КАК Характеристика,
//		|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
//		|		ЗапасыОстатки.Характеристика КАК Характеристика,
//		|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
//		|	ИЗ
//		|		РегистрНакопления.Запасы.Остатки(
//		|				,
//		|				ЗаказПокупателя = &ДокументОснование
//		|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗапасыОстатки
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		РазмещениеОстатки.Номенклатура,
//		|		РазмещениеОстатки.Характеристика,
//		|		РазмещениеОстатки.КоличествоОстаток
//		|	ИЗ
//		|		РегистрНакопления.РазмещениеЗаказов.Остатки(
//		|				,
//		|				ЗаказПокупателя = &ДокументОснование
//		|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК РазмещениеОстатки
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ДвиженияДокументаРазмещениеЗаказов.Номенклатура,
//		|		ДвиженияДокументаРазмещениеЗаказов.Характеристика,
//		|		ВЫБОР
//		|			КОГДА ДвиженияДокументаРазмещениеЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//		|				ТОГДА ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
//		|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
//		|		КОНЕЦ
//		|	ИЗ
//		|		РегистрНакопления.РазмещениеЗаказов КАК ДвиженияДокументаРазмещениеЗаказов
//		|	ГДЕ
//		|		ДвиженияДокументаРазмещениеЗаказов.Регистратор = &Ссылка
//		|		И ДвиженияДокументаРазмещениеЗаказов.ЗаказПокупателя = &ДокументОснование) КАК ЗаказыОстатки
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ЗаказыОстатки.Номенклатура,
//		|	ЗаказыОстатки.Характеристика
//		|
//		|ИМЕЮЩИЕ
//		|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	МИНИМУМ(ЗаказПокупателяМатериалы.НомерСтроки) КАК НомерСтроки,
//		|	ЗаказПокупателяМатериалы.Номенклатура КАК Номенклатура,
//		|	ЗаказПокупателяМатериалы.Характеристика КАК Характеристика,
//		|	ЗаказПокупателяМатериалы.Партия КАК Партия,
//		|	ВЫБОР
//		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
//		|			ТОГДА 1
//		|		ИНАЧЕ ЗаказПокупателяМатериалы.ЕдиницаИзмерения.Коэффициент
//		|	КОНЕЦ КАК Коэффициент,
//		|	ЗаказПокупателяМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//		|	ВЫБОР
//		|		КОГДА ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
//		|			ТОГДА ЗаказПокупателяМатериалы.Ссылка.Организация.СтавкаНДСПоУмолчанию
//		|		ИНАЧЕ ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС
//		|	КОНЕЦ КАК СтавкаНДС,
//		|	ЗаказПокупателяМатериалы.Ссылка.Старт КАК ЗапасыДатаПоступления,
//		|	СУММА(ЗаказПокупателяМатериалы.Количество) КАК Количество
//		|ИЗ
//		|	Документ.ЗаказПокупателя.Материалы КАК ЗаказПокупателяМатериалы
//		|ГДЕ
//		|	ЗаказПокупателяМатериалы.Ссылка = &ДокументОснование
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ЗаказПокупателяМатериалы.Номенклатура,
//		|	ЗаказПокупателяМатериалы.Характеристика,
//		|	ЗаказПокупателяМатериалы.Партия,
//		|	ЗаказПокупателяМатериалы.ЕдиницаИзмерения,
//		|	ЗаказПокупателяМатериалы.Ссылка,
//		|	ВЫБОР
//		|		КОГДА ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
//		|			ТОГДА ЗаказПокупателяМатериалы.Ссылка.Организация.СтавкаНДСПоУмолчанию
//		|		ИНАЧЕ ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС
//		|	КОНЕЦ,
//		|	ВЫБОР
//		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
//		|			ТОГДА 1
//		|		ИНАЧЕ ЗаказПокупателяМатериалы.ЕдиницаИзмерения.Коэффициент
//		|	КОНЕЦ,
//		|	ЗаказПокупателяМатериалы.Ссылка.Старт
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки";
//		
//	КонецЕсли;
//	
//	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылкаЗаказПокупателя);
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	
//	МассивРезультатов = Запрос.ВыполнитьПакет();
//	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
//	ТаблицаОстатков.Индексы.Добавить("Номенклатура,Характеристика");
//	
//	Запасы.Очистить();
//	Если ТаблицаОстатков.Количество() > 0 Тогда
//		
//		Выборка = МассивРезультатов[1].Выбрать();
//		Пока Выборка.Следующий() Цикл
//			
//			СтруктураДляПоиска = Новый Структура;
//			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
//			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
//			
//			МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
//			Если МассивСтрокОстатков.Количество() = 0 Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			НоваяСтрока = Запасы.Добавить();
//			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
//			
//			КоличествоКСписанию = Выборка.Количество * Выборка.Коэффициент;
//			МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоКСписанию;
//			Если МассивСтрокОстатков[0].КоличествоОстаток < 0 Тогда
//				
//				НоваяСтрока.Количество = (КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент;
//				
//			КонецЕсли;
//			
//			//НоваяСтрока.ДатаПоступления = Выборка.ЗапасыДатаПоступления;
//			//Если ДатаПоступления <> НоваяСтрока.ДатаПоступления Тогда
//			//	ПоложениеДатыПоступленияВШапке = Ложь;
//			//КонецЕсли;
//			
//			Если МассивСтрокОстатков[0].КоличествоОстаток <= 0 Тогда
//				ТаблицаОстатков.Удалить(МассивСтрокОстатков[0]);
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//	КонецЕсли;
//	

//	
//	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
//		
//		МассивРезультатов = Запрос.ВыполнитьПакет();
//		ТаблицаОстатков = МассивРезультатов[2].Выгрузить();
//		ТаблицаОстатков.Индексы.Добавить("Номенклатура,Характеристика");
//		
//		Выборка = МассивРезультатов[3].Выбрать();
//		Пока Выборка.Следующий() Цикл
//			
//			СтруктураДляПоиска = Новый Структура;
//			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
//			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
//			
//			МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
//			Если МассивСтрокОстатков.Количество() = 0 Тогда
//				
//				НоваяСтрока = Запасы.Добавить();
//				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
//				
//			ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) = Выборка.Количество Тогда
//				
//				Продолжить;
//				
//			ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) > Выборка.Количество Тогда
//				
//				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - Выборка.Количество * Выборка.Коэффициент;
//				Продолжить;
//				
//			ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) < Выборка.Количество Тогда
//				
//				КоличествоКСписанию = -1 * (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент - Выборка.Количество);
//				МассивСтрокОстатков[0].КоличествоОстаток = 0;
//				
//				НоваяСтрока = Запасы.Добавить();
//				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
//				
//				НоваяСтрока.Количество = (КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент;
//				
//			КонецЕсли;


//			//НоваяСтрока.ДатаПоступления = Выборка.ЗапасыДатаПоступления;
//			//Если ДатаПоступления <> НоваяСтрока.ДатаПоступления Тогда
//			//	ПоложениеДатыПоступленияВШапке = Ложь;
//			//КонецЕсли;
//			
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//КонецПроцедуры
//	
	

	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если НЕ ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах Тогда
		Возврат;
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыЗаказаНаПеремещения.Утвержден Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказНаПеремещениеЗапасы.Ссылка.Дата КАК Период,
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
			|	ЗаказНаПеремещениеЗапасы.Ссылка КАК Заказ,
			|	ЗаказНаПеремещениеЗапасы.Ссылка.СтруктурнаяЕдиница,
			|	ЗаказНаПеремещениеЗапасы.Номенклатура,
			|	ЗаказНаПеремещениеЗапасы.Характеристика,
			|	ЗаказНаПеремещениеЗапасы.Партия,
			|	СУММА(ВЫБОР
			|			КОГДА ЗаказНаПеремещениеЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.КлассификаторЕдиницИзмерения
			|				ТОГДА ЗаказНаПеремещениеЗапасы.УтвержденноеКоличество
			|			ИНАЧЕ ЗаказНаПеремещениеЗапасы.УтвержденноеКоличество * ЗаказНаПеремещениеЗапасы.ЕдиницаИзмерения.Коэффициент
			|		КОНЕЦ) КАК Количество
			|ИЗ
			|	Документ.ВнутреннийЗаказ.Запасы КАК ЗаказНаПеремещениеЗапасы
			|ГДЕ
			|	ЗаказНаПеремещениеЗапасы.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказНаПеремещениеЗапасы.Номенклатура,
			|	ЗаказНаПеремещениеЗапасы.Характеристика,
			|	ЗаказНаПеремещениеЗапасы.Партия,
			|	ЗаказНаПеремещениеЗапасы.Ссылка.Дата,
			|	ЗаказНаПеремещениеЗапасы.Ссылка,
			|	ЗаказНаПеремещениеЗапасы.Ссылка.СтруктурнаяЕдиница";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		ТаблицаЗаказов = Запрос.Выполнить().Выгрузить();		
	Иначе
		ТаблицаЗаказов = Новый ТаблицаЗначений;
	КонецЕсли;
	ДвиженияЗаказов = Движения.ЗаказыНаПеремещение;
	ДвиженияЗаказов.Записывать = Истина;
	ДвиженияЗаказов.Загрузить(ТаблицаЗаказов);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах");
	Если ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах Тогда
		Если Статус = Перечисления.СтатусыЗаказаНаПеремещения.Утвержден Тогда
			ПроверяемыеРеквизиты.Добавить("Запасы.УтвержденноеКоличество");
		КонецЕсли;
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения( ДокументСсылкаЗаказПокупателя)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// მოცემული ფრაგმენტი შექმნილია კონსტრუქტორით.
	// კონსტრუქტორის ხელმეორედ გამოყენების შემთხვევაში, მექანიკურად შეყვანილი ცვლილებები დაიკარგება!!!
	Если ТипЗнч(ДокументСсылкаЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		// ქუდის შევსება
		Автор = ДокументСсылкаЗаказПокупателя.Автор;
		ДокументВизита = ДокументСсылкаЗаказПокупателя.ДокументВизита;
		ЗапретРедактированияДокументов = ДокументСсылкаЗаказПокупателя.ЗапретРедактированияДокументов;
		Комментарий = ДокументСсылкаЗаказПокупателя.Комментарий;
		Организация = ДокументСсылкаЗаказПокупателя.Организация;
		Ответственный = ДокументСсылкаЗаказПокупателя.Ответственный;
		СтруктурнаяЕдиница = ДокументСсылкаЗаказПокупателя.СтруктурнаяЕдиницаРезерв;
		Для Каждого ТекСтрокаЗапасы Из ДокументСсылкаЗаказПокупателя.Запасы Цикл
			НоваяСтрока = Запасы.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаЗапасы.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ТекСтрокаЗапасы.Количество;
			НоваяСтрока.Партия = ТекСтрокаЗапасы.Партия;
			НоваяСтрока.Характеристика = ТекСтрокаЗапасы.Характеристика;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументСсылкаЗаказПокупателя) Тогда
		ЗаполнитьПоЗаказуНаПроизводство(ДокументСсылкаЗаказПокупателя);
	Иначе
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДокументСсылкаЗаказПокупателя);
		Если Ссылка.Пустая() Тогда
			СтруктурнаяЕдиница = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(, "ОсновнойСклад");
		КонецЕсли;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуНаПроизводство(ДокументСсылкаЗаказПокупателя)
	
	// Заполнение шапки.
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылкаЗаказПокупателя,
	Новый Структура("Организация, Ссылка, ВидОперации, Старт, ДатаОтгрузки, СостояниеЗаказа, Проведен, ОжидаетсяВыборВариантаКП"));
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(ДокументСсылкаЗаказПокупателя, ЗначенияРеквизитов);
	
	Организация = ЗначенияРеквизитов.Организация;
	ЗаказПокупателя = ЗначенияРеквизитов.Ссылка;
	//Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
	//	ДатаПоступления = ЗначенияРеквизитов.Старт;
	//Иначе
	//	ДатаПоступления = ЗначенияРеквизитов.ДатаОтгрузки;
	//КонецЕсли;
	
	// Заполнение табличной части.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.Характеристика КАК Характеристика,
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыОстатки.Характеристика КАК Характеристика,
	|		ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗаказыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗапасыОстатки.Номенклатура,
	|		ЗапасыОстатки.Характеристика,
	|		-ЗапасыОстатки.КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗапасыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РазмещениеОстатки.Номенклатура,
	|		РазмещениеОстатки.Характеристика,
	|		-РазмещениеОстатки.КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказов.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК РазмещениеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаРазмещениеЗаказов.Номенклатура,
	|		ДвиженияДокументаРазмещениеЗаказов.Характеристика,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРазмещениеЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказов КАК ДвиженияДокументаРазмещениеЗаказов
	|	ГДЕ
	|		ДвиженияДокументаРазмещениеЗаказов.Регистратор = &Ссылка
	|		И ДвиженияДокументаРазмещениеЗаказов.ЗаказПокупателя = &ДокументОснование) КАК ЗаказыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыОстатки.Номенклатура,
	|	ЗаказыОстатки.Характеристика
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ЗаказПокупателяЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Старт
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ДатаОтгрузки
	|	КОНЕЦ КАК ЗапасыДатаПоступления,
	|	ЗаказПокупателяЗапасы.СтавкаНДС,
	|	СУММА(ЗаказПокупателяЗапасы.Количество) КАК Количество,
	|	ЗаказПокупателяЗапасы.Спецификация
	|ИЗ
	|	ВТЗаказПокупателяЗапасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяЗапасы.Номенклатура,
	|	ЗаказПокупателяЗапасы.Характеристика,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	|	ЗаказПокупателяЗапасы.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Старт
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ДатаОтгрузки
	|	КОНЕЦ,
	|	ЗаказПокупателяЗапасы.Спецификация
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(ДокументСсылкаЗаказПокупателя, Запрос.МенеджерВременныхТаблиц, Ложь);
	
	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		
		Запрос.Текст = Запрос.Текст + "; " +
		"ВЫБРАТЬ
		|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказыОстатки.Характеристика КАК Характеристика,
		|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|		ЗапасыОстатки.Характеристика КАК Характеристика,
		|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.Запасы.Остатки(
		|				,
		|				ЗаказПокупателя = &ДокументОснование
		|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗапасыОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РазмещениеОстатки.Номенклатура,
		|		РазмещениеОстатки.Характеристика,
		|		РазмещениеОстатки.КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.РазмещениеЗаказов.Остатки(
		|				,
		|				ЗаказПокупателя = &ДокументОснование
		|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК РазмещениеОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокументаРазмещениеЗаказов.Номенклатура,
		|		ДвиженияДокументаРазмещениеЗаказов.Характеристика,
		|		ВЫБОР
		|			КОГДА ДвиженияДокументаРазмещениеЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
		|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РазмещениеЗаказов КАК ДвиженияДокументаРазмещениеЗаказов
		|	ГДЕ
		|		ДвиженияДокументаРазмещениеЗаказов.Регистратор = &Ссылка
		|		И ДвиженияДокументаРазмещениеЗаказов.ЗаказПокупателя = &ДокументОснование) КАК ЗаказыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыОстатки.Номенклатура,
		|	ЗаказыОстатки.Характеристика
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ЗаказПокупателяМатериалы.НомерСтроки) КАК НомерСтроки,
		|	ЗаказПокупателяМатериалы.Номенклатура КАК Номенклатура,
		|	ЗаказПокупателяМатериалы.Характеристика КАК Характеристика,
		|	ЗаказПокупателяМатериалы.Партия КАК Партия,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|			ТОГДА 1
		|		ИНАЧЕ ЗаказПокупателяМатериалы.ЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ КАК Коэффициент,
		|	ЗаказПокупателяМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
		|			ТОГДА ЗаказПокупателяМатериалы.Ссылка.Организация.СтавкаНДСПоУмолчанию
		|		ИНАЧЕ ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС
		|	КОНЕЦ КАК СтавкаНДС,
		|	ЗаказПокупателяМатериалы.Ссылка.Старт КАК ЗапасыДатаПоступления,
		|	СУММА(ЗаказПокупателяМатериалы.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаказПокупателя.Материалы КАК ЗаказПокупателяМатериалы
		|ГДЕ
		|	ЗаказПокупателяМатериалы.Ссылка = &ДокументОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяМатериалы.Номенклатура,
		|	ЗаказПокупателяМатериалы.Характеристика,
		|	ЗаказПокупателяМатериалы.Партия,
		|	ЗаказПокупателяМатериалы.ЕдиницаИзмерения,
		|	ЗаказПокупателяМатериалы.Ссылка,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
		|			ТОГДА ЗаказПокупателяМатериалы.Ссылка.Организация.СтавкаНДСПоУмолчанию
		|		ИНАЧЕ ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|			ТОГДА 1
		|		ИНАЧЕ ЗаказПокупателяМатериалы.ЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ,
		|	ЗаказПокупателяМатериалы.Ссылка.Старт
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылкаЗаказПокупателя);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
		
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
	ТаблицаОстатков.Индексы.Добавить("Номенклатура,Характеристика");
	
	Запасы.Очистить();
	Если ТаблицаОстатков.Количество() > 0 Тогда
		
		Выборка = МассивРезультатов[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтруктураДляПоиска = Новый Структура;
			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
			
			МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
			Если МассивСтрокОстатков.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			КоличествоКСписанию = Выборка.Количество * Выборка.Коэффициент;
			МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоКСписанию;
			Если МассивСтрокОстатков[0].КоличествоОстаток < 0 Тогда
				
				НоваяСтрока.Количество = (КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент;
				
			КонецЕсли;
			
			//НоваяСтрока.ДатаПоступления = Выборка.ЗапасыДатаПоступления;
			//Если ДатаПоступления <> НоваяСтрока.ДатаПоступления Тогда
			//	ПоложениеДатыПоступленияВШапке = Ложь;
			//КонецЕсли;
			
			Если МассивСтрокОстатков[0].КоличествоОстаток <= 0 Тогда
				ТаблицаОстатков.Удалить(МассивСтрокОстатков[0]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		ТаблицаОстатков = МассивРезультатов[2].Выгрузить();
		ТаблицаОстатков.Индексы.Добавить("Номенклатура,Характеристика");
		
		Выборка = МассивРезультатов[3].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтруктураДляПоиска = Новый Структура;
			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
			
			МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
			Если МассивСтрокОстатков.Количество() = 0 Тогда
				
				НоваяСтрока = Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
			ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) = Выборка.Количество Тогда
				
				Продолжить;
				
			ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) > Выборка.Количество Тогда
				
				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - Выборка.Количество * Выборка.Коэффициент;
				Продолжить;
				
			ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) < Выборка.Количество Тогда
				
				КоличествоКСписанию = -1 * (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент - Выборка.Количество);
				МассивСтрокОстатков[0].КоличествоОстаток = 0;
				
				НоваяСтрока = Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
				НоваяСтрока.Количество = (КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент;
				
			КонецЕсли;


			//НоваяСтрока.ДатаПоступления = Выборка.ЗапасыДатаПоступления;
			//Если ДатаПоступления <> НоваяСтрока.ДатаПоступления Тогда
			//	ПоложениеДатыПоступленияВШапке = Ложь;
			//КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	

КонецПроцедуры
